Repository: san2025am/guard_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# app_title
source: Sanam Security
ar: سنام الأمن

# theme_light
source: Light
ar: نهاري

# theme_dark
source: Dark
ar: ليلي

source: Toggle Theme
ar: تبديل الثيم

source: Language
ar: اللغة

# language_settings_title
source: Language preferences
ar: إعدادات اللغة

# language_settings_hint
source: Choose your preferred language below
ar: اختر لغتك المفضلة من الخيارات أدناه

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

# session_timeout_title
source: Session timeout
ar: انتهاء الجلسة

# session_timeout_message
source: No activity detected. You will be logged out in {seconds} seconds.
ar: لم يتم رصد أي نشاط. سيتم تسجيل الخروج خلال {seconds} ثانية.

# session_timeout_keep
source: Keep working
ar: متابعة الاستخدام

# session_timeout_logout
source: Logout now
ar: تسجيل الخروج الآن

source: Login
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: Forgot password?
ar: نسيت كلمة المرور؟

# device_untrusted_title
source: Unregistered Device
ar: متصفح غير مسجل

# device_untrusted_message
source: Dear user, this device is not trusted yet. If you want to continue, you need to add it to your trusted devices list.
ar: عزيزي العميل، هذا الجهاز غير موثوق. إذا كنت ترغب في استخدامه، يمكنك إضافته إلى قائمة أجهزتك الموثوقة.

# device_untrusted_accept
source: Yes
ar: نعم

# device_untrusted_decline
source: No
ar: لا

# device_otp_instructions
source: Enter the verification code sent to {destination}.
ar: أدخل رمز التحقق المرسل إلى {destination}.

# device_otp_label
source: Verification code
ar: رمز التحقق

# device_otp_confirm
source: Verify device
ar: توثيق الجهاز

# device_otp_destination_email
source: your email
ar: بريدك الإلكتروني

source: Device verification cancelled
ar: تم إلغاء توثيق الجهاز

# device_verification_required
source: Device verification is required to complete the login.
ar: يجب توثيق الجهاز لإكمال تسجيل الدخول.

# biometric_login_button
source: Log in with {method}
ar: تسجيل الدخول باستخدام {method}

# biometric_auth_reason
source: Confirm your identity using {method}.
ar: يرجى تأكيد هويتك باستخدام {method}.

# biometric_enable_title
source: Enable biometric login?
ar: تفعيل تسجيل الدخول بالبصمة؟

# biometric_enable_message
source: Would you like to use {method} for faster logins?
ar: هل تود استخدام {method} لتسجيل الدخول بشكل أسرع؟

# biometric_enable_confirm
source: Enable
ar: تفعيل

# biometric_enable_skip
source: Not now
ar: لاحقاً

# biometric_enabled_confirmation
source: Biometric login with {method} has been enabled.
ar: تم تفعيل تسجيل الدخول بواسطة {method}.

# biometric_not_configured
source: Biometric login is not configured yet.
ar: لم يتم إعداد تسجيل الدخول بالبصمة بعد.

# biometric_auth_failed
source: Biometric authentication failed.
ar: فشل التحقق الحيوي.

# biometric_method_face
source: Face ID
ar: بصمة الوجه

# biometric_method_fingerprint
source: Fingerprint
ar: بصمة الإصبع

# biometric_method_iris
source: Iris
ar: بصمة العين

# biometric_method_generic
source: Biometric
ar: البصمة الحيوية

# guard_tasks_title
source: My tasks
ar: مهامي

# guard_tasks_hint
source: Track assigned tasks and update their status.
ar: تابع المهام المسندة وحدّث حالتها.

# tasks_screen_title
source: My Tasks
ar: مهامي

# task_location_label
source: Location
ar: الموقع

# task_due_date
source: Due: {date}
ar: تاريخ الاستحقاق: {date}

# task_status_note_label
source: Note
ar: ملاحظة

# task_note_hint
source: Add details for this status update (optional)
ar: أضف تفاصيل عن هذا التحديث (اختياري)

# task_update_success
source: Task updated successfully.
ar: تم تحديث المهمة.

# task_update_failure
source: Couldn't update the task.
ar: تعذّر تحديث المهمة.

# tasks_load_error
source: Couldn't load tasks.
ar: تعذّر تحميل المهام.

# task_update_button
source: Move to {status}
ar: تغيير الحالة إلى {status}

# task_note_dialog_title
source: Update to {status}
ar: تحديث إلى {status}

# task_cancel
source: Cancel
ar: إلغاء

# task_confirm
source: Confirm
ar: تأكيد

# task_no_items
source: No tasks assigned at the moment.
ar: لا توجد مهام مسندة حالياً.

# uniform_request_title
source: Uniform request
ar: طلب زي

# uniform_request_hint
source: Select the pieces you need to request.
ar: اختر قطع الزي المطلوبة.

# uniform_items_empty
source: No pieces selected yet.
ar: لم تتم إضافة أي قطعة بعد.

# uniform_items_required
source: Please add at least one uniform piece.
ar: يرجى إضافة قطعة واحدة على الأقل.

# uniform_items_load_error
source: Couldn't load uniform items. Try again later.
ar: تعذّر تحميل قائمة الزي. حاول لاحقاً.

# uniform_add_item
source: Add piece
ar: إضافة قطعة

# uniform_edit_item
source: Edit piece
ar: تعديل القطعة

# uniform_select_item
source: Choose a piece
ar: اختر قطعة

# uniform_quantity
source: Quantity
ar: الكمية

# uniform_quantity_invalid
source: Enter a valid quantity
ar: أدخل كمية صحيحة

# uniform_item_notes
source: Notes
ar: ملاحظات

# uniform_payment_method
source: Payment method
ar: طريقة الدفع

# uniform_payment_direct
source: Direct payment
ar: دفع مباشر

# uniform_payment_deduction
source: Salary deduction
ar: خصم من الراتب

# uniform_item_remove
source: Remove
ar: حذف

# uniform_total_value
source: Estimated total: {value}
ar: الإجمالي التقريبي: {value}

# send_code
source: Send code to email
ar: إرسال الرمز للبريد

source: Reset password
ar: استعادة كلمة المرور

# code
source: Code (6 digits)
ar: الرمز (6 أرقام)

source: New password
ar: كلمة المرور الجديدة

source: Change password
ar: تغيير كلمة المرور

# guard_home
source: Guard Dashboard
ar: لوحة حارس الأمن

source: Welcome!
ar: مرحبًا بك!

source: Profile
ar: الملف الشخصي

source: Attendance
ar: التحضير

source: Reports & Requests
ar: التقارير والطلبات

source: Role
ar: الدور

# sync
source: Refresh
ar: تحديث البيانات

# sync_hint
source: Pull latest username/role from device
ar: يجلب أحدث اسم المستخدم/الدور من الجهاز

# checked_in
source: You are checked in
ar: تم تسجيل حضورك

# checked_out
source: You are checked out
ar: أنت خارج الدوام

source: Check in
ar: تسجيل حضور

source: Check out
ar: تسجيل انصراف

source: Attendance history
ar: سجل التحضير

# attendance_history_hint
source: View your past check-ins
ar: اعرض سجلات حضورك السابقة

source: Create report
ar: إنشاء تقرير

# create_report_hint
source: Send a new report to supervisor
ar: ارسال تقرير جديد للمشرف

# report_subject
source: Subject
ar: الموضوع

# report_subject_required
source: Subject is required
ar: حقل الموضوع مطلوب

# report_details
source: Details
ar: التفاصيل

# report_details_required
source: Details are required
ar: حقل التفاصيل مطلوب

# report_type_label
source: Report type
ar: نوع التقرير

# report_type_required
source: Please choose the report type
ar: يرجى اختيار نوع التقرير

# report_type_daily
source: Daily report
ar: تقرير يومي

# report_type_monthly
source: Monthly report
ar: تقرير شهري

# report_type_security
source: Security incident
ar: بلاغ أمني

# report_type_complaint
source: Complaint
ar: شكوى

# report_add_attachment
source: Add attachment
ar: إضافة مرفق

# report_attachments
source: Attachments
ar: المرفقات

# report_attachment_image_camera
source: Capture photo
ar: التقاط صورة بالكاميرا

# report_attachment_image_gallery
source: Choose photo from gallery
ar: اختيار صورة من المعرض

# report_attachment_video_camera
source: Record video
ar: تسجيل فيديو

# report_attachment_video_gallery
source: Choose video from gallery
ar: اختيار فيديو من المعرض

# report_attachment_remove
source: Remove
ar: إزالة

# report_attachment_pick_error
source: Couldn't pick attachment
ar: تعذر اختيار المرفق

source: Submit report
ar: إرسال التقرير

# report_submit_success
source: Report submitted successfully
ar: تم إرسال التقرير بنجاح

# report_submit_error
source: Could not submit the report
ar: تعذر إرسال التقرير

source: Open requests
ar: الطلبات المفتوحة

# open_requests_hint
source: View and track your requests
ar: اعرض وتتبع طلباتك

# requests_empty_state
source: No open requests yet.
ar: لا توجد طلبات مفتوحة بعد.

# requests_load_error
source: Couldn't load requests
ar: تعذر تحميل الطلبات

source: Retry
ar: إعادة المحاولة

# open_advances
source: Advance requests
ar: طلبات السلف

# open_advances_hint
source: Review submitted salary advances
ar: مراجعة طلبات السلف السابقة

# request_type
source: Type
ar: النوع

# request_status
source: Status
ar: الحالة

# request_submitted_on
source: Submitted on
ar: تاريخ التقديم

source: Create request
ar: إنشاء طلب

# create_request_hint
source: Send a new request
ar: إرسال طلب جديد

# request_type_required
source: Please choose a request type
ar: يرجى اختيار نوع الطلب

# request_type_coverage
source: Coverage
ar: تغطية

# request_type_leave
source: Leave
ar: إجازة

# request_type_transfer
source: Transfer
ar: نقل

# request_type_materials
source: Materials
ar: مواد

# request_description
source: Description
ar: التفاصيل

# request_description_required
source: Description is required
ar: حقل التفاصيل مطلوب

# leave_start_datetime
source: Leave start
ar: بداية الإجازة

# leave_end_datetime
source: Leave end
ar: نهاية الإجازة

# leave_start_not_selected
source: No start selected
ar: لم يتم اختيار البداية

# leave_end_not_selected
source: No end selected
ar: لم يتم اختيار النهاية

# leave_pick_dates_required
source: Please select start and end for the leave
ar: يرجى اختيار وقت البداية والنهاية للإجازة

# leave_end_must_follow_start
source: End must be after start
ar: يجب أن تكون النهاية بعد البداية

# leave_range
source: Leave period
ar: مدة الإجازة

# leave_hours_label
source: Leave hours
ar: ساعات الإجازة

# create_advance
source: New advance request
ar: طلب سلفة جديد

# create_advance_short
source: New advance
ar: سلفة جديدة

# create_advance_hint
source: Submit a salary advance request
ar: إرسال طلب سلفة من الراتب

# advance_amount
source: Amount
ar: المبلغ

# advance_amount_required
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صحيح

# advance_reason
source: Reason (optional)
ar: السبب (اختياري)

# advance_submit
source: Submit advance
ar: إرسال طلب السلفة

# advance_submit_success
source: Advance request submitted
ar: تم إرسال طلب السلفة

# advance_submit_error
source: Could not submit the advance request
ar: تعذر إرسال طلب السلفة

# advances_load_error
source: Couldn't load advances
ar: تعذر تحميل السلف

# advances_empty_state
source: No advances yet.
ar: لا توجد طلبات سلف حتى الآن.

# advance_requested_on
source: Requested on
ar: تم الطلب في

# advance_approved_on
source: Approved on
ar: تمت الموافقة في

# currency_short_symbol
source: SAR
ar: ر.س

source: Submit request
ar: إرسال الطلب

# request_submit_success
source: Request submitted successfully
ar: تم إرسال الطلب بنجاح

# request_submit_error
source: Could not submit the request
ar: تعذّر إرسال الطلب

# request_approval_notes
source: Decision notes
ar: ملاحظات القرار

# request_approver
source: Handled by
ar: تمت المعالجة بواسطة

source: Coming soon
ar: قريبًا

# request_leave
source: Leave request
ar: طلب إجازة

# request_leave_hint
source: Submit a leave request to your supervisor
ar: قدّم طلب إجازة إلى المشرف

source: Logout
ar: تسجيل الخروج

# logoutTooltip
source: Sign out of the account
ar: خروج من الحساب

# environment_violation_title
source: Security Warning
ar: تنبيه أمني

# environment_violation_message
source: We detected {issues}. Please disable VPN or mock-location tools before using the app.
ar: تم الكشف عن {issues}. يرجى تعطيل برامج VPN أو تزييف الموقع لمتابعة استخدام التطبيق.

# environment_violation_reason_vpn
source: an active VPN connection
ar: اتصال VPN نشط

# environment_violation_reason_mock
source: a mock-location application
ar: تطبيق لتزييف الموقع

# environment_violation_exit
source: Exit app
ar: إغلاق التطبيق
